# Pandas concat() method:

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9])
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
s2 = pd.Series([19,18,17,16,15,14,13,12,11])
s2

0    19
1    18
2    17
3    16
4    15
5    14
6    13
7    12
8    11
dtype: int64

In [8]:
pd.concat([s1,s2])

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
0    19
1    18
2    17
3    16
4    15
5    14
6    13
7    12
8    11
dtype: int64

In [9]:
pd.concat([s1,s2], axis=1)

   0   1
0  1  19
1  2  18
2  3  17
3  4  16
4  5  15
5  6  14
6  7  13
7  8  12
8  9  11

In [10]:
df1 = pd.DataFrame({"RollNo":[146,147,148,149]})
df1

   RollNo
0     146
1     147
2     148
3     149

In [12]:
df2 = pd.DataFrame({"Names":["Sheethal","Shivam","Shreya","Shubham"]})
df2

      Names
0  Sheethal
1    Shivam
2    Shreya
3   Shubham

In [14]:
df3 = pd.concat([df1,df2])

In [15]:
df3

   RollNo     Names
0   146.0       NaN
1   147.0       NaN
2   148.0       NaN
3   149.0       NaN
0     NaN  Sheethal
1     NaN    Shivam
2     NaN    Shreya
3     NaN   Shubham

In [20]:
df4 = pd.concat([df1,df2], axis=1)

In [23]:
df4

   RollNo     Names
0     146  Sheethal
1     147    Shivam
2     148    Shreya
3     149   Shubham

In [25]:
df5 = pd.DataFrame({"RollNo":[1,2,3,4,5]})
df5

   RollNo
0       1
1       2
2       3
3       4
4       5

In [26]:
df6 = pd.DataFrame({"Names":["Sheethal","Shivam","Shreya","Shubham","Iflah","Aastha","Zohra"]})
df6

      Names
0  Sheethal
1    Shivam
2    Shreya
3   Shubham
4     Iflah
5    Aastha
6     Zohra

In [28]:
pd.concat([df5,df6])

   RollNo     Names
0     1.0       NaN
1     2.0       NaN
2     3.0       NaN
3     4.0       NaN
4     5.0       NaN
0     NaN  Sheethal
1     NaN    Shivam
2     NaN    Shreya
3     NaN   Shubham
4     NaN     Iflah
5     NaN    Aastha
6     NaN     Zohra

In [29]:
pd.concat([df5,df6], axis=1)

   RollNo     Names
0     1.0  Sheethal
1     2.0    Shivam
2     3.0    Shreya
3     4.0   Shubham
4     5.0     Iflah
5     NaN    Aastha
6     NaN     Zohra

In [30]:
pd.concat([df5,df6], axis=1, join="inner")

   RollNo     Names
0       1  Sheethal
1       2    Shivam
2       3    Shreya
3       4   Shubham
4       5     Iflah

In [31]:
pd.concat([df5,df6], axis=1, join="outer")

   RollNo     Names
0     1.0  Sheethal
1     2.0    Shivam
2     3.0    Shreya
3     4.0   Shubham
4     5.0     Iflah
5     NaN    Aastha
6     NaN     Zohra